{
  "works": {
    "headlines": {
      "about": "About",
      "image": "Image / Movie",
      "skill": "Skill",
      "production-time": "Production Time",
      "media": "Media"
    },
    "underthewater": {
      "title": "Music Video - Under The Water",
      "desc": "The graduation work of Digital Hollywood 3DCG/VFX course. All CG models in this video were created with Maya. GPGPU, compute shader is used to represent the fish school that swim based on the swarm algorithm and trail particle. The wire frame in the latter half of the video is also implemented with ShaderLab, and it is emitted by the post process in Unity. And the camera work is created on Timeline and Cinemachine, and the scene is shot almost once. Finally what I adjusted on After Effects is simple noise expression and time-remapping.",
      "production-time": "from July to August, 2019. (about 2months)"
    },
    "office": {
      "title": "SHOWROOM Inc. Office in Arai Building",
      "desc": "Produced a work three months after entering Digital Hollywood 3DCG course. I thought that it might be commonplace to work in VR in the near future, and reproduced my office with 3DCG to get a more specific image.\n\nI used about 30 spotlights and point lights, and tried to make the standlights see-through with SSS. So I spent some time around the lighting using Arnold. I modeled everything other than the human body model shot at Super Scan Studio.",
      "production-time": "December, 2018. (about 2weeks)"
    },
    "readyyy": {
      "title": "SHOWROOM V - Readyyy!",
      "desc": "Live2D version of the application, SHOWROOM V that enables a user to live stream as virtual character on smartphone. Virtual Livestreamers often make models in the format of VRM, but in reality, many people are using two-dimensional illustrations instead, so there is a demand for Live2D. We distributed an app customized for each organizer, and this time, I customized our app to have performers of SEGA's new idol project “Readyyy!” live stream on SHOWROOM. Since December 2018, each member regularly live stream, and I maintain backgrounds and characters each time.\n\nI’m in charge of programming and management. The library, ULSee is adopted to replace the tracking code entirely for VRM with for Live2D. Based on the acquired vertex information, the parameter threshold and tracking sensitivity were adjusted so that the performer moved most naturally. Performance was not good when there was a lot of access, so I tuned that I reviewed the memory, cache, draw calls and texture bakes.",
      "production-time": "from October to December 2018. (about 3months)"
    },
    "tele-magic": {
      "title": "Tele-Magic",
      "desc": "A tower defense game where you can experience a kind of telexistence experience while watching the live streaming video of Theta placed at a distance of 2 to 3 meters from you.\n\nFirst, when you sit facing the Theta and wear the HMD, you will see you wearing the HMD in real world (transfer to Theta's point of view). Since the enemy will advance toward you in real world when you press the start button, you should generate explosion magic and repel the enemy.\n\nIt is a simple operation that only looks at the bursting magic switch, but also requires the strategy that it can not be cleared unless the bursting magic is generated at an optimal timing considering the casting time, the remaining number of switches, its own HP, enemy speed, etc.",
      "cap1": "Theta with background",
      "cap2": "Theta without background",
      "cap3": "exhibited at VR Contents fes. 2018 Spring",
      "production-time": "February 2018. (about 2weeks)"
    },
    "gracity": {
      "title": "Gracity",
      "desc": "I made a VR online multiplayer game with PUN and VRTK. The stage is a medieval city. A player, sorcerer gets magic wands scattered all over the city and tries to beat down the enemies he encounters. Incorporating a gimmick of weight change, from Gravity and City, I gave a title Gracity, coined word.\n\nExhibited at the 2nd VR Academy Audition. Three modes of Practice, PvP, PvE are prepared to consider the level of VR familiarity of the visitors. On the day, there were many VR professionals, so most people enjoyed PvE mode. While it is a multiplayer game, I participated in on browser mode and provided covering fire.",
      "cap1": "Exhibition",
      "cap2": "User guide",
      "production-time": "from December 2017 to January 2018. (about 1month)"
    },
    "showstage": {
      "title": "SHOWSTAGE",
      "desc": "The website of the Live VR Platform 'SHOWSTAGE' that supports the integrated VR headset 'Oculus Go'. This is E-commerce web site which has functions such as searching lives, notification, login, purchasing ticket, purchase history and screenshot list.\n\nOne web front-end engineer and two back-end engineers write program. I'm in web front-end.",
      "cap1": "Top page",
      "cap2": "Live page",
      "cap3": "Confirmation page ",
      "cap4": "My tickets page",
      "cap5": "Purchasing points page",
      "cap6": "Settings page",
      "production-time": "from August to December, 2019. (about 5month)"
    },
    "onepiece": {
      "title": "ONE PIECE Whole Cake Island Arc - Web site interacted with TV animated show",
      "desc": "A 12-week continuous project in which the TV Anime, 'One Piece' and the smartphone are linked in real time. You try to mash a button when you are excited on air. Divide one broadcast into 30 scenes and you can get an opportunity to apply for the present if the scene you select and the scene other viewer select are same.\n\nI'm in charge of top screen and result screen on air. The total number of viewers, the number of taps of everyone for each scene and the number of taps of individuals were displayed in real time to give a sense of coordination. Data is acquired by regularly calling API while considering performance. In terms of direction, we use D3.js to draw interactive and scalable graphs. Animations such as an interruption animation, a result screen slot, and a confetti effect that are caught in any place on air. There are also 7 pattern design changes according to the tone-manner of each broadcast. While the clear deadline of on-air day was decided, we dealt with the request from the client until the last minute. During one week before the first on-air day, we worked staying overnight at the company, and I acquired the basic strength of creator.",
      "cap1": "On air page",
      "cap2": "Result page",
      "cap3": "appeared in Weekly Shonen Jump",
      "cap4": "Playing",
      "cap5": "Capture",
      "cap6": "Special program",
      "production-time": "from September to October, 2017. (about 2months)"
    },
    "kamakura": {
      "title": "The 69th Kamakura Fireworks Festival",
      "desc": "It was decided to hold the Kamakura Fireworks Festival, which was temporarily suspended, in crowdfunding. The official website to launch fireworks with their supporters' messages and names.\n\nI'm in charge of the animation of fireworks. I launched three kinds of fireworks, weeping willows, underwater and circular, and randomly generated geometric fireworks. While finely adjusting various parameters such as particle amount, transparency, gravity, velocity, lifespan, etc. I also expressed attention to afterimage, water surface reflection, wave and ship fluctuation, etc. to make it more realistic. BGM is united and the Web Site is finished quite emo.",
      "cap1": "Weeping willow",
      "cap2": "Underwater fireworks",
      "cap3": "The 2017 October issue of Brain, Creator Magazine",
      "production-time": "from May to June, 2017. (about 3weeks)"
    },
    "hirameki": {
      "title": "Hirameki engine",
      "desc": "Digital Signage providing the seed of new idea created by combining the words that users always put in the back of their head such as brainstorming titles and business keywords, and incidental words that don't relate to it such as buzzwords and dictionary words. It was first introduced in the conference room of the Innovation Lab, which is HONDA's most advanced research and development institutions. It's licensed and sold as an application.\n\nI'm in charged of whole web-front-end part. I obtained buzzwords with various APIs, and made SVG animation using a library, Bodymovin.",
      "cap1": "Default",
      "cap2": "in Kayac Inc",
      "cap3": "in Nomurakougei Inc",
      "production-time": "from January to February, 2017. (about 1month)\nfrom January to February, 2018. (about 1month)"
    },
    "mental-energy": {
      "title": "Mental Energy",
      "desc": "The graduation work of the school for engineer, G's Academy.\n\nMental Energy is simply the number of times people can make decisions in a day. Which foods to eat, which clothes to wear, which TV shows to watch... mental energy decreases with each such minor decision. It is said that Steve Jobs wore the same clothes every day to reduce unnecessary decisions and preserve mental energy for important decisions such as business management.\n\nTherefore, I made a service that you can find extra decisions and managed them like a to-do list. I developed from front-end to back-end, i.g. Data Management, Data Analysis and Visualization to user feedback.",
      "cap1": "Promotion video",
      "cap2": "Register your rules",
      "cap3": "Check your rules on the map",
      "cap4": "Visualize your progress",
      "production-time": "from May to June, 2016. (about 1month)"
    },
    "world-heritage": {
      "title": "WebGL World Heritage",
      "desc": "Graduation work of Digital Hollywood Tokyo School.\n\nAn infographic work that visualizes all World Heritage using WebGL. I used 1,031 data (i.g. latitude, longitude, registered year, genre) from July 2015.",
      "cap1": "Tutorial",
      "cap2": "Show modal",
      "cap3": "Promotion video",
      "cap4": "Interview",
      "cap5": "Digital Frontier Grand Prix 2016 award ceremony",
      "production-time": "from May to June, 2015. (about 3weeks)"
    },
    "tabippo": {
      "title": "",
      "desc": "",
      "production-time": ""
    },
    "poster": {
      "title": "",
      "desc": "",
      "production-time": ""
    },
    "copywriting": {
      "title": "",
      "desc": "",
      "production-time": ""
    }
  }
}
