{
	"LOCALE_JA": "JPN",
	"LOCALE_EN": "ENG",
	"TOP_PROFILE_NAME": "Kazuki Mochizuki",
	"TOP_PROFILE_ROLL": "Programmer",
	"TOP_HISTORY_COMPANY": "EMPLOYMENT",
	"TOP_HISTORY_COMPANY_1": "KAYAC.INC",
	"TOP_HISTORY_COMPANY_1_DESC_1": "Web Front-End Engineer",
	"TOP_HISTORY_COMPANY_1_DESC_2": "Full-time",
	"TOP_HISTORY_COMPANY_2": "SHOWROOM",
	"TOP_HISTORY_COMPANY_2_DESC_1": "Web Front-End Engineer",
	"TOP_HISTORY_COMPANY_2_DESC_2": "Full-time",
	"TOP_HISTORY_SCHOOL": "EDUCATION",
	"TOP_HISTORY_SCHOOL_1": "KEIO UNIVERSITY",
	"TOP_HISTORY_SCHOOL_1_DESC_1": "Bachelor of Arts in Human Science",
	"TOP_HISTORY_SCHOOL_1_DESC_2": "Development Economics Seminar",
	"TOP_HISTORY_SCHOOL_2": "DIGITAL HOLLYWOOD SCHOOL",
	"TOP_HISTORY_SCHOOL_2_DESC_1": "Interactive Design Course",
	"TOP_HISTORY_SCHOOL_2_DESC_2": "3DCG/VFX Course, a scholarship student",
	"WORK_HEADLINE_ABOUT": "About",
	"WORK_HEADLINE_IMAGE": "Image",
	"WORK_HEADLINE_SKILL": "Skill",
	"WORK_HEADLINE_PRODUCTION_TIME": "Production Time",
	"WORK_HEADLINE_MEDIA": "Media",
	"WORK_SHOWSTAGE_TITLE": "SHOWSTAGE",
	"WORK_SHOWSTAGE_DESC": "The website of the Live VR Platform 'SHOWSTAGE' that supports the integrated VR headset 'Oculus Go'. A feature-rich e-commerce site: you can login, search for concerts, purchase tickets, see purchase history and screen shots, etc.\n\nIt was created by one engineer on the web front-end and two on the back-end. I am responsible for the former.",
	"WORK_SHOWSTAGE_CAP1": "Top page",
	"WORK_SHOWSTAGE_CAP2": "Live page",
	"WORK_SHOWSTAGE_CAP3": "Confirmation page",
	"WORK_SHOWSTAGE_CAP4": "My tickets page",
	"WORK_SHOWSTAGE_CAP5": "Purchasing points page",
	"WORK_SHOWSTAGE_CAP6": "Settings page",
	"WORK_SHOWSTAGE_PRODUCTION_TIME": "from August to December, 2019. (about 5month)",
	"WORK_KAMAKURA_TITLE": "The 69th Kamakura Fireworks Festival",
	"WORK_KAMAKURA_DESC": "It was decided to hold the Kamakura Fireworks Festival, which was temporarily suspended, in crowdfunding. The official website to launch fireworks with their supporters' messages and names.\n\nI'm in charge of the animation of fireworks. I launched three kinds of fireworks, weeping willows, underwater and circular, and randomly generated geometric fireworks. While finely adjusting various parameters such as particle amount, transparency, gravity, velocity, lifespan, etc. I also expressed attention to afterimage, water surface reflection, wave and ship fluctuation, etc. to make it more realistic. The site is quite emotive with background music.",
	"WORK_KAMAKURA_CAP1": "Weeping willow",
	"WORK_KAMAKURA_CAP2": "Underwater fireworks",
	"WORK_KAMAKURA_CAP3": "The 2017 October issue of Brain, Creator Magazine",
	"WORK_KAMAKURA_PRODUCTION_TIME": "from May to June, 2017. (about 3weeks)",
	"WORK_ONEPIECE_TITLE": "ONE PIECE Whole Cake Island Arc - Web site interacted with TV animated show",
	"WORK_ONEPIECE_DESC": "A 12-week continuous project in which the TV Anime, 'One Piece' and the smartphone are linked in real time. You try to mash a button when you are excited on air. Divide one broadcast into 30 scenes and you can get an opportunity to apply for the present if the scene you select and the scene other viewer select are same.\n\nI'm in charge of top screen and result screen on air. The total number of viewers, the number of taps of everyone for each scene and the number of taps of individuals were displayed in real time to give a sense of coordination. Data is acquired by regularly calling API while considering performance. In terms of direction, we use D3.js to draw interactive and scalable graphs. Animations such as an interruption animation, a result screen slot, and a confetti effect that are caught in any place on air. There are also 7 pattern design changes according to the tone-manner of each broadcast. While the clear deadline of on-air day was decided, we dealt with the request from the client until the last minute. During one week before the first on-air day, we worked staying overnight at the company, and I acquired the basic strength of creator.",
	"WORK_ONEPIECE_CAP1": "On air page",
	"WORK_ONEPIECE_CAP2": "Result page",
	"WORK_ONEPIECE_CAP3": "appeared in Weekly Shonen Jump",
	"WORK_ONEPIECE_CAP4": "Playing",
	"WORK_ONEPIECE_CAP5": "Capture",
	"WORK_ONEPIECE_CAP6": "Special program",
	"WORK_ONEPIECE_PRODUCTION_TIME": "from September to October, 2017. (about 2months)",
	"WORK_HIRAMEKI_TITLE": "Hirameki engine",
	"WORK_HIRAMEKI_DESC": "Digital Signage providing the seed of new idea created by combining the words that users always put in the back of their head such as brainstorming titles and business keywords, and incidental words that don't relate to it such as buzzwords and dictionary words. It was first introduced in the conference room of the Innovation Lab, which is HONDA's most advanced research and development institutions. It's licensed and sold as an application.\n\nI'm in charged of whole web-front-end part. I obtained buzzwords with various APIs, and made SVG animation using a library, Bodymovin.",
	"WORK_HIRAMEKI_CAP1": "Default",
	"WORK_HIRAMEKI_CAP2": "in Kayac Inc",
	"WORK_HIRAMEKI_CAP3": "in Nomurakougei Inc",
	"WORK_HIRAMEKI_PRODUCTION_TIME": "from January to February, 2017. (about 1month)\nfrom January to February, 2018. (about 1month)",
	"WORK_MENTAL_ENERGY_TITLE": "Mental Energy",
	"WORK_MENTAL_ENERGY_DESC": "The graduation work of the school for engineer, G's Academy.\n\nMental Energy is simply the number of times people can make decisions in a day. Which foods to eat, which clothes to wear, which TV shows to watch... mental energy decreases with each such minor decision. It is said that Steve Jobs wore the same clothes every day to reduce unnecessary decisions and preserve mental energy for important decisions such as business management.\n\nTherefore, I made a service that you can find extra decisions and managed them like a to-do list. I developed from front-end to back-end, i.g. Data Management, Data Analysis and Visualization to user feedback.",
	"WORK_MENTAL_ENERGY_CAP1": "Promotion video",
	"WORK_MENTAL_ENERGY_CAP2": "Register your rules",
	"WORK_MENTAL_ENERGY_CAP3": "Check your rules on the map",
	"WORK_MENTAL_ENERGY_CAP4": "Visualize your progress",
	"WORK_MENTAL_ENERGY_PRODUCTION_TIME": "from May to June, 2016. (about 1month)",
	"WORK_WORLD_HERITAGE_TITLE": "WebGL World Heritage",
	"WORK_WORLD_HERITAGE_DESC": "Graduation work of Digital Hollywood Tokyo School.\n\nAn infographic work that visualizes all World Heritage using WebGL. I used 1,031 data (i.g. latitude, longitude, registered year, genre) from July 2015.",
	"WORK_WORLD_HERITAGE_CAP1": "Tutorial",
	"WORK_WORLD_HERITAGE_CAP2": "Modal",
	"WORK_WORLD_HERITAGE_CAP3": "Promotion video",
	"WORK_WORLD_HERITAGE_CAP4": "Interview",
	"WORK_WORLD_HERITAGE_CAP5": "Digital Frontier Grand Prix 2016 award ceremony",
	"WORK_WORLD_HERITAGE_PRODUCTION_TIME": "from May to June, 2015. (about 3weeks)",
	"OTHERS_LICENSE": "The Official Business Skills Test in Bookkeeping, 2nd grade",
	"OTHERS_LANGUAGE": "Japanese - Native, English - Basic"
}