{
	"LOCALE_JA": "JPN",
	"LOCALE_EN": "ENG",
	"TOP_PROFILE_NAME": "Kazuki Mochizuki",
	"TOP_PROFILE_ROLL": "Programmer",
	"TOP_HISTORY_COMPANY": "EMPLOYMENT",
	"TOP_HISTORY_COMPANY_1": "KAYAC.INC",
	"TOP_HISTORY_COMPANY_1_DESC_1": "Web Front-End Engineer",
	"TOP_HISTORY_COMPANY_1_DESC_2": "Full-time",
	"TOP_HISTORY_COMPANY_2": "SHOWROOM",
	"TOP_HISTORY_COMPANY_2_DESC_1": "Web Front-End Engineer",
	"TOP_HISTORY_COMPANY_2_DESC_2": "Full-time",
	"TOP_HISTORY_SCHOOL": "EDUCATION",
	"TOP_HISTORY_SCHOOL_1": "KEIO UNIVERSITY",
	"TOP_HISTORY_SCHOOL_1_DESC_1": "Bachelor of Arts in Human Science",
	"TOP_HISTORY_SCHOOL_1_DESC_2": "Development Economics Seminar",
	"TOP_HISTORY_SCHOOL_2": "DIGITAL HOLLYWOOD SCHOOL",
	"TOP_HISTORY_SCHOOL_2_DESC_1": "Interactive Design Course",
	"TOP_HISTORY_SCHOOL_2_DESC_2": "3DCG/VFX Course, a scholarship student",
	"WORK_HEADLINE_ABOUT": "About",
	"WORK_HEADLINE_IMAGE": "Image",
	"WORK_HEADLINE_SKILL": "Skill",
	"WORK_HEADLINE_PRODUCTION_TIME": "Production Time",
	"WORK_HEADLINE_MEDIA": "Media",
	"WORK_SHOWSTAGE_TITLE": "SHOWSTAGE",
	"WORK_SHOWSTAGE_DESC": "The website of the Live VR Platform 'SHOWSTAGE' that supports the integrated VR headset 'Oculus Go'. A feature-rich e-commerce site: you can login, search for concerts, purchase tickets, see purchase history and screen shots, etc.\n\nIt was created by one engineer on the web front-end and two on the back-end. I am responsible for the former.",
	"WORK_SHOWSTAGE_CAP1": "Top page",
	"WORK_SHOWSTAGE_CAP2": "Live page",
	"WORK_SHOWSTAGE_CAP3": "Confirmation page",
	"WORK_SHOWSTAGE_CAP4": "My tickets page",
	"WORK_SHOWSTAGE_CAP5": "Purchasing points page",
	"WORK_SHOWSTAGE_CAP6": "Settings page",
	"WORK_SHOWSTAGE_PRODUCTION_TIME": "from August to December, 2019. (about 5month)",
	"WORK_KAMAKURA_TITLE": "The 69th Kamakura Fireworks Festival",
	"WORK_KAMAKURA_DESC": "It was decided to hold the Kamakura Fireworks Festival, which was temporarily suspended, in crowdfunding. The official website to launch fireworks with their supporters' messages and names.\n\nI'm in charge of the animation of fireworks. I launched three kinds of fireworks, weeping willows, underwater and circular, and randomly generated geometric fireworks. While finely adjusting various parameters such as particle amount, transparency, gravity, velocity, lifespan, etc. I also expressed attention to afterimage, water surface reflection, wave and ship fluctuation, etc. to make it more realistic. The site is quite emotive with background music.",
	"WORK_KAMAKURA_CAP1": "Weeping willow",
	"WORK_KAMAKURA_CAP2": "Underwater fireworks",
	"WORK_KAMAKURA_CAP3": "The 2017 October issue of Brain, Creator Magazine",
	"WORK_KAMAKURA_PRODUCTION_TIME": "from May to June, 2017. (about 3weeks)",
	"WORK_ONEPIECE_TITLE": "ONE PIECE Whole Cake Island Arc - Web site interacted with TV animated show",
	"WORK_ONEPIECE_DESC": "A 12-week continuous project in which the TV Anime, 'One Piece' and the smartphone are linked in real time. You try to mash a button when you are excited on air. Divide one broadcast into 30 scenes and you can get an opportunity to apply for the present if the scene you select and the scene other viewer select are same.\n\nI'm in charge of top screen and result screen on air. The total number of viewers, the number of taps of everyone for each scene and the number of taps of individuals were displayed in real time to give a sense of coordination. Data is acquired by regularly calling API while considering performance. In terms of direction, we use D3.js to draw interactive and scalable graphs. Animations such as an interruption animation, a result screen slot, and a confetti effect that are caught in any place on air. There are also 7 pattern design changes according to the tone-manner of each broadcast. While the clear deadline of on-air day was decided, we dealt with the request from the client until the last minute. During one week before the first on-air day, we worked staying overnight at the company, and I acquired the basic strength of creator.",
	"WORK_ONEPIECE_CAP1": "On air page",
	"WORK_ONEPIECE_CAP2": "Result page",
	"WORK_ONEPIECE_CAP3": "appeared in Weekly Shonen Jump",
	"WORK_ONEPIECE_CAP4": "Playing",
	"WORK_ONEPIECE_CAP5": "Capture",
	"WORK_ONEPIECE_CAP6": "Special program",
	"WORK_ONEPIECE_PRODUCTION_TIME": "from September to October, 2017. (about 2months)"
}